idaohang/stm32gps-sleep/Project/stm32gps/main.c
/**
 ******************************************************************************
 * @file    USART/Printf/main.c
 * @author  MCD Application Team
 * @version V3.5.0
 * @date    08-April-2011
 * @brief   Main program body
 ******************************************************************************
 * @attention
 *
 * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
 * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
 * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
 * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
 * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
 * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
 *
 * <h2><center>&copy; COPYRIGHT 2011 STMicroelectronics</center></h2>
 ******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "stm32f10x.h"
#include "stm32f10x_it_api.h"
#include "stm32gps_board.h"
#include "stm32gps_config.h"
#include <stdio.h>
#include <string.h>
#include "usart.h"
#include "GSM_App.h"
#include "device.h"
#include "eelink.h"
#include "gpio.h"
#include "gps.h"


/* Private typedef -----------------------------------------------------------*/

/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/

/* Private variables ---------------------------------------------------------*/

static uint16_t g_usSequenceNum;  		// GPRS packet's sequence number
static uint8_t g_ucGPSStatus;    		// GPS status 0x55 - error; 0xaa - ok
static uint32_t g_uiSetSleepSec;  		// Server setting sleep seconds
static FlagStatus g_uiAlarmFlag;  		// 报警标志 SET-valid; RESET-invalid
static FlagStatus g_uiAlarmPacketFlag; 	// 报警数据包标志 SET - alarm packet; RESET - not alarm packet
static FlagStatus g_uiPreStickFlag; 	// 吸合状态 SET - Stick ON; RESET - Stick OFF
static FlagStatus g_uiCurStickFlag; 	// 吸合状态 SET - Stick ON; RESET - Stick OFF


static uint8_t g_ucSignalQuality;

static ST_DEVICEDATA g_stDeviceData;
static ST_BATVOLTAGESTATUS g_stBATInfo;
static ST_CREGINFO g_stCREGInfo;
static ST_IMSIINFO g_stIMSIInfo;
static stru_GPSDATA g_stGPSData;
static ST_PACKET_BASESTATION g_stStationInfo;

static uint8_t g_ucIMEIBuf[IMEI_BUF_LEN];
static uint8_t g_ucIMSIBuf[IMSI_BUF_LEN];
static uint8_t g_ucPhoneNumBuf[PHONE_NUM_BUF_LEN];

static char LoginBuf[PROTO_LOGIN_BUF_LEN];
static char gpsBuf[PROTO_GPS_BUF_LEN];
//static char stationBuf[PROTO_STATION_BUF_LEN];


/* Private function prototypes -----------------------------------------------*/
FlagStatus GetStickState(void);
static uint8_t ProcessIMEI(uint8_t *pImei, uint8_t *pRst, int32_t imeilen, int32_t rstlen);
static void PackLoginMsg(void);
static void PackGpsMsg(void);
static void PackAlarmMsg(void);
static void PackStationMsg(void);
static void PackFactoryMsg(void);
/* Private functions ---------------------------------------------------------*/

#ifdef DBG_ENABLE_MACRO
void ShowLoginMsg(void)
{
    uint32_t i;
    // imei
    DEBUG("IMEI:");
    for(i = 0; i < IMEI_BUF_LEN; i++)
    {
        DEBUG("%c-", g_ucIMEIBuf[i]);
    }
    DEBUG("\r\n");
    // login msg
    DEBUG("\r\nLOGIN MSG:");
    for(i = 0; i < PROTO_LOGIN_BUF_LEN; i++)
    {
        DEBUG("0x%x-", LoginBuf[i]);
    }
    DEBUG("\r\n");
}

void ShowGpsMsg(uint32_t len)
{
    uint32_t i;
    // gps msg
    DEBUG("\r\n GPS,STATION or ALARM MSG:");
    for(i = 0; i < len; i++)
    {
        DEBUG("0x%x-", gpsBuf[i]);
    }
    DEBUG("\r\n");
}

void ShowGpsData(void)
{
    uint32_t i;

    DEBUG("UTC:");
    for(i = 0; i < 4; i++)
    {
        DEBUG("0x%x-", g_stGPSData.utc.s[i]);
    }
    DEBUG("\r\n");

    DEBUG("LATI:");
    for(i = 0; i < 4; i++)
    {
        DEBUG("0x%x-", g_stGPSData.latitude.s[i]);
    }
    DEBUG("\r\n");

    DEBUG("LONGI:");
    for(i = 0; i < 4; i++)
    {
        DEBUG("0x%x-", g_stGPSData.longitude.s[i]);
    }
    DEBUG("\r\n");

    DEBUG("SPEED: %d\r\n", g_stGPSData.speed);
    DEBUG("COURSE:");
    for(i = 0; i < 2; i++)
    {
        DEBUG("0x%x-", g_stGPSData.course.s[i]);
    }
    DEBUG("\r\n");
    DEBUG("STATUS: %d\r\n", g_stGPSData.status);

}

#if 0
void ShowStationMsg(void)
{
    uint32_t i;
    // gps msg
    DEBUG("\r\nSTATION MSG:");
    for(i = 0; i < (8 + g_stStationInfo.num * 11); i++)
    {
        DEBUG("0x%x-", stationBuf[i]);
    }
    DEBUG("\r\n");
}


void ShowFactoryMsg(void)
{
    uint32_t i;
    // gps msg
    DEBUG("\r\nFACTORY MSG:");
    for(i = 0; i < FACTORY_REPORT_MSGLEN; i++)
    {
        DEBUG("0x%x-", stationBuf[i]);
    }
    DEBUG("\r\n");
}
#endif
#endif // DBG_ENABLE_MACRO

/**
  * @brief  Init Global Variables
  * @param  None
  * @retval None
  */
void InitVariables(void)
{
    g_usSequenceNum = 1;
    g_ucGPSStatus = GPS_DEVICE_ERR;
    g_uiSetSleepSec = SLEEP_NORMAL_SEC;
    g_uiAlarmFlag = RESET;
    g_uiAlarmPacketFlag = RESET;
	g_uiPreStickFlag = RESET;
	g_uiCurStickFlag = RESET;
	
    g_ucSignalQuality = 0;

    memset(&g_stDeviceData, 0, sizeof(g_stDeviceData));
    memset(&g_stBATInfo, 0, sizeof(g_stBATInfo));
    memset(&g_stCREGInfo, 0, sizeof(g_stCREGInfo));
    memset(&g_stIMSIInfo, 0, sizeof(g_stIMSIInfo));
    memset(&g_stGPSData, 0, sizeof(g_stGPSData));
    memset(&g_stStationInfo, 0, sizeof(g_stStationInfo));

    memset(g_ucIMEIBuf, 0, IMEI_BUF_LEN);
    memset(g_ucIMSIBuf, 0, IMSI_BUF_LEN);
    memset(g_ucPhoneNumBuf, 0, PHONE_NUM_BUF_LEN);

    memset(LoginBuf, 0, PROTO_LOGIN_BUF_LEN);
    memset(gpsBuf, 0, PROTO_GPS_BUF_LEN);
}


/**
 * @brief  Main program
 * @param  None
 * @retval None
 */
int main(void)
{
    uint32_t errNum = 0;
    uint8_t gpsRecvTimes = 0;  // GPS Received Times
    uint8_t gsmRetyTimes = 0;  // GSM Retry Times
    uint8_t gprsRetyTimes = 0; // GPRS Retry Times

    uint8_t gpsRtn = RST_FAIL;    // GPS function return result
    uint8_t gsmRtn = RST_FAIL;
    uint8_t gprsRtn = USART_FAIL;
    uint8_t gprsSendFlag = RST_FAIL; // GPRS Send Status Flag

    uint16_t sendLen = 0;      // GPRS send length (used for GPS and ALARM Msg)
    uint32_t sleepSec = 0;

