idaohang/stm32gps-sleep/Project/stm32gps/main.c
    // Used for parse GPRS Received Data Analysis
    char *pRecvBuf = NULL;     // GPRS Received buffer
    uint32_t recvLen = 0;      // GPRS Received length
    char *pfeed = NULL;        // Used for parse

    // Used for CheckLinkStatus
#ifdef DBG_ENABLE_MACRO
    uint8_t status = 0;
#endif

	/* 4 bits for Preemption Priority and 0 bits for Sub Priority */
    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_4);

    /////////////////////////////////////////////////////////////////
    // Configure the GPIO ports and Power OFF GPS and GSM
    /////////////////////////////////////////////////////////////////
    MX_GPIO_Init();
    GPSPowerOff();
    GSM_PowerOff();

    /////////////////////////////////////////////////////////////////
    // Configure the SysTick
    /////////////////////////////////////////////////////////////////
    stm32gps_sys_tick_cfg();

    /////////////////////////////////////////////////////////////////
    // Configure PWR and BKP
    /////////////////////////////////////////////////////////////////
    /* Enable PWR and BKP clock */
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_PWR | RCC_APB1Periph_BKP, ENABLE);
    /* Enable WKUP pin */
    //    PWR_WakeUpPinCmd(ENABLE);

    /////////////////////////////////////////////////////////////////
    // Configure RCC
    /////////////////////////////////////////////////////////////////
    //RCC_Configuration();

	/////////////////////////////////////////////////////////////////
    // Configure NVIC
    /////////////////////////////////////////////////////////////////
    NVIC_Configuration();
	
    /////////////////////////////////////////////////////////////////
    // Configure RTC EXTI
    /////////////////////////////////////////////////////////////////
    EXTI_Configuration();

    /////////////////////////////////////////////////////////////////
    // Configure RTC
    /////////////////////////////////////////////////////////////////
    RTC_Configuration();
   // RTC_NVIC_Configuration();

    /////////////////////////////////////////////////////////////////
    // Configure TIMER
    /////////////////////////////////////////////////////////////////
    TIM2_Configuration();
    //TIM2_NVIC_Configuration();

    /////////////////////////////////////////////////////////////////
    // Configure LED, BUTTON and USART(GPS + GSM + DEBUG)
    /////////////////////////////////////////////////////////////////

    stm32gps_led_cfg();
    STM_EVAL_LEDOff(LED1);
#ifdef DBG_ENABLE_MACRO
    stm32gps_com_debug_cfg();
#endif // DBG_ENABLE_MACRO

    STM_EVAL_PBInit(BUTTON_KEY, BUTTON_MODE_EXTI);

    //usart_init(STM32_SIM908_GPS_COM);
    stm32gps_com_gps_cfg();

    usart_init(STM32_SIM908_GSM_COM);
    stm32gps_com_gsm_cfg();
    /* Enable the EVAL_COM2 Receive interrupt: this interrupt is generated when the
     EVAL_COM1 receive data register is not empty */
    USART_ITConfig(EVAL_COM2, USART_IT_RXNE, ENABLE);
    //USART_NVIC_Configuration();

    /////////////////////////////////////////////////////////////////
    // Turn On TIM2
    /////////////////////////////////////////////////////////////////
    //TIM2_Start();

    /////////////////////////////////////////////////////////////////
    // Init Global Variables
    /////////////////////////////////////////////////////////////////
    InitVariables();

    /////////////////////////////////////////////////////////////////
    // Main LOOP
    /////////////////////////////////////////////////////////////////
    while(1)
    {
        /////////////////////////////////////////////////////////////////
        // Init Local Variables
        /////////////////////////////////////////////////////////////////
        errNum = 0;
        gpsRecvTimes = 0;
        gsmRetyTimes = 0;
        gprsRetyTimes = 0;

        gpsRtn = RST_FAIL;
        gprsSendFlag = RST_FAIL;

        sendLen = 0;
        sleepSec = 0;
		
        /////////////////////////////////////////////////////////////////
        // Detect Stick Status
        /////////////////////////////////////////////////////////////////
        g_uiCurStickFlag = GetStickState();
		if((RESET == g_uiCurStickFlag) && (g_uiCurStickFlag != g_uiPreStickFlag))
		{
			g_uiAlarmFlag = SET;
		}
		g_uiPreStickFlag = g_uiCurStickFlag;
        
DEBUG("\r g_uiCurStickFlag = %d; g_uiAlarmFlag = %d; g_uiAlarmPacketFlag = %d\n", g_uiCurStickFlag, g_uiAlarmFlag, g_uiAlarmPacketFlag);
		// If Stick On Car or sth
		if((SET == g_uiCurStickFlag) || (SET == g_uiAlarmFlag) || (SET == g_uiAlarmPacketFlag))
        {
            
            // GPS ALARM
            if(SET != g_uiAlarmFlag)
            {
	            /////////////////////////////////////////////////////////////////
	            // First, Power ON GPS
	            /////////////////////////////////////////////////////////////////
	            GPSPowerOn();
	            DEBUG("\r\n GPSPowerOn \r\n");
	            delay_10ms(200);
	            /////////////////////////////////////////////////////////////////
	            // Receive GPS Data and Parse, If Recv Success then break
	            /////////////////////////////////////////////////////////////////
	            memset(&g_stGPSData, 0, sizeof(g_stGPSData));
#ifdef DBG_ENABLE_MACRO
	            ShowGpsData();
#endif
	            while(gpsRecvTimes < GPS_RETERY_TIMES)
	            {
	                gpsRecvTimes++;
	                TIM2_Start();
	                gpsRtn = GetGPSData();
	                TIM2_Stop();

	                if(RST_OK == gpsRtn)
	                {
	                    g_ucGPSStatus = GPS_DEVICE_OK;
	                    DEBUG("Receive GPS Data\r\n");
	                    //ParseGPSData(&g_stGPSData);

	                    //if(1 == g_stGPSData.status)
	                    if('A' == g_stGPSRMCData.Status)
	                    {
	                        ParseGPSData(&g_stGPSData);
#ifdef DBG_ENABLE_MACRO
	                        ShowGpsData();
#endif
	                        GPSPowerOff();
	                        DEBUG("GPSData Valid and TurnOFF GPS\r\n");
	                        break;
	                    }
	                }
					
	                delay_10ms(1000);
	            }
            }

            /////////////////////////////////////////////////////////////////
            // Second, Power ON GSM
            /////////////////////////////////////////////////////////////////
			
            GSM_PowerOn();
			DEBUG("\r\n GSMPowerOn \r\n");
            delay_10ms(200);

            gsmRetyTimes = 0;
            gsmRtn = RST_FAIL;

            while(gsmRetyTimes < GSM_RETERY_TIMES)
            {
                gsmRetyTimes++;
				
                gsmRtn = GSM_Init();
                if(RST_FAIL == gsmRtn)
                {
                    continue;
                }
                gsmRtn = GSM_CheckSIMCard();
                if(RST_FAIL == gsmRtn)
                {
                    continue;
                }

