idaohang/stm32gps-sleep/Project/stm32gps/main.c
                gsmRtn = GSM_QuerySignal(&g_ucSignalQuality);
                if(RST_FAIL == gsmRtn)
                {
					DEBUG("\r\n GSM_QuerySignal FAIL \r\n");
                    continue;
                }

                gsmRtn = GSM_CheckNetworkReg();
                if(RST_FAIL == gsmRtn)
                {
                    continue;
                }

                GSM_SetNetworkReg(2);
                if(USART_FAIL == GSM_QueryCreg(&g_stCREGInfo))
                {
                    // clear creg info
                }

                gsmRtn = GSM_QueryImei(g_ucIMEIBuf);
                if(RST_FAIL == gsmRtn)
                {
                    // clear imei buffer
                }

                gsmRtn = GSM_QueryImsi(&g_stIMSIInfo);
                if(RST_FAIL == gsmRtn)
                {
                    // clear imsi info
                }

                GSM_SetCIPMode(0);

                gsmRtn = GSM_CheckGPRSService();
                if(RST_FAIL == gsmRtn)
                {
                    continue;
                }

                gsmRtn = GSM_QueryBatVoltage(&g_stBATInfo);
                if(RST_FAIL == gsmRtn)
                {
                    // clear battery info
                }

                gsmRtn = GSM_ceng(&g_stStationInfo);
                if(RST_FAIL == gsmRtn)
                {
                    // clear station info
                }

                gprsRetyTimes = 0;
                gsmRtn = RST_FAIL;
                while(gprsRetyTimes < GPRS_RETRY_TIMES)
                {
                    gprsRetyTimes++;
                    GPRS_CIPShut();
#ifdef DBG_ENABLE_MACRO
                    GPRS_CheckLinkStatus(&status);
#endif									   
                    gsmRtn = GSM_StartTaskAndSetAPN();
                    if(RST_FAIL == gsmRtn)
                    {
                        continue;
                    }
#ifdef DBG_ENABLE_MACRO
                    GPRS_CheckLinkStatus(&status);
#endif

                    gsmRtn = GSM_BringUpConnect();
                    if(RST_FAIL == gsmRtn)
                    {
                        //continue;
                    }
#ifdef DBG_ENABLE_MACRO
                    GPRS_CheckLinkStatus(&status);
#endif
                    gsmRtn = GSM_GetLocalIP();
                    if(RST_FAIL == gsmRtn)
                    {
                        //continue;
                    }
#ifdef DBG_ENABLE_MACRO
                    GPRS_CheckLinkStatus(&status);
#endif
                    gsmRtn = GSM_StartUpConnect();
                    if(RST_FAIL == gsmRtn)
                    {
                        continue;
                    }
#ifdef DBG_ENABLE_MACRO
                    GPRS_CheckLinkStatus(&status);
#endif
                    /////////////////////////////////////////////////////////////////
                    // Send LOGIN Msg
                    /////////////////////////////////////////////////////////////////
                    g_usSequenceNum = 1; // Init packet sequence to 1
                    errNum = 0;
                    gprsRtn = USART_FAIL;

                    PackLoginMsg();
#ifdef DBG_ENABLE_MACRO
                    ShowLoginMsg();
#endif
                    while(errNum < 5)
                    {
                        errNum++;
                        gprsRtn = GPRS_SendData_rsp(LoginBuf, EELINK_LOGIN_MSGLEN, &pRecvBuf, &recvLen);
                        if(USART_SUCESS == gprsRtn)
                        {
                            // parse response data, pp is 0x70 0x70
                            pfeed = strstr_len(pRecvBuf, "pp", recvLen);
                            if(pfeed != NULL)
                            {
                                sleepSec = (uint32_t)(((*(pfeed + 7)) << 24)
                                                      + ((*(pfeed + 8)) << 16)
                                                      + ((*(pfeed + 9)) << 8)
                                                      + (*(pfeed + 10)));
                                
                                // Check sleep time setting value
                                if((sleepSec > SLEEP_TIME_MIN) && (sleepSec < SLEEP_TIME_MAX))
                                {
                                    g_uiSetSleepSec = sleepSec;

                                }
                                DEBUG("g_uiSetSleepSec = %d\n", g_uiSetSleepSec);
                            }
                            else
                            {
                                DEBUG("Server Set Sleep Timer ERROR\n");
                            }
                            break;
                        }
                        else
                        {

#ifdef DBG_ENABLE_MACRO
                            //STM_EVAL_LEDToggle(LED1);
                            DEBUG("GPRS_SendData LOGIN MSG Fail\n");
#endif // DBG_ENABLE_MACRO

                        }
                    }

                    /////////////////////////////////////////////////////////////////
                    // Send GPS/STATION or ALARM Msg
                    /////////////////////////////////////////////////////////////////
                    g_usSequenceNum++;
                    errNum = 0;
                    gprsRtn = USART_FAIL;

					if(SET == g_uiAlarmFlag)
					{
						PackAlarmMsg();
                        sendLen = EELINK_ALARM_MSGLEN;
						g_uiAlarmPacketFlag = SET;
						DEBUG("PackAlarmMsg\r\n");
					}
					else
					{
	                    if(1 == g_stGPSData.status)
	                    {
	                        PackGpsMsg();
	                        sendLen = EELINK_GPS_MSGLEN;
	                        DEBUG("PackGpsMsg\r\n");
	                    }
	                    else
	                    {
	                        PackStationMsg();
	                        sendLen = (8 + (g_stStationInfo.num * 11));
	                        DEBUG("PackStationMsg\r\n");
	                    }
						g_uiAlarmPacketFlag = RESET;
					}

#ifdef DBG_ENABLE_MACRO
                    ShowGpsMsg(sendLen);
#endif

